#g = {

 #   'Google' :87 ,
  #  'Baidu' :18,
   # 'Яндекс':6,
    
 # }

#print(f"пошукові системи \n {g}")


 
#2

sprav= {

's_1':'пок. кота',
's_2':'сдам кровь',
's_3':'пред. дверь',
's_4':'поем',

    } 
print(f"1 day {sprav['s_1']} , {sprav['s_2']} \n 2 day {sprav['s_3']} , {sprav['s_4']}")
#3
#aline={"Hi":"Dana","С днем рождения":"Meli","C праздником лошадей":"Andreu"}
#print(aline)
#4
#aline={"Обезьян":100,"Цветов":200,"Машин":1,"Мечей":1}
#print(aline)
#5
#a=int(input(':'))
#aline={a:a**2}
#print(aline)
#6
#aline={"Симуляторы":"Симулятор Тигра","Спортивные":"NBA 2K21","Приключения, адвенчуры":"София: Лесные Приключения"}
#print(aline)
#7
#aline={
#    "Линус Торвальдс":"28 декабря 1969",
#       "Сэр Тим Бернерс-Ли ":"8 июня 1955 ",
#       "Дональд Кнут":"10 января 1938 ",
#       "Брендан Айк":"4 июля 1961"
#}

#a=input("Введите имя программиста дата рождения которого вас интересует : ")
#if a=="Линус Торвальдс":
#    for kay, value in aline.items():
#        print(f"Линус Торвальдс:{value[0]}")


#8
#aling=("Сыр","Молоко","яблоко")
#a=input("Что есть в холодильнике? : ")
#for dimension in aling:
#    if a==aling[0]:
#        print("Ok")
#    elif a==aling[1]:
#        print("Ok")
#    elif a==aling[2]:
#        print("Ok")
#    else:
#        print("No")

#9
aling={"Япония":"численность населения 125,8 миллиона (2020 г.), В состав Японии входит более 6 800 островов. Самые крупные из них – это Хоккайдо, Хонсю, Сикоку и Кюсю."
    ,"Китай":"численность населения:1,402 миллиарда (2020 г.) "}
print(aling)


